Revit 2024 API
ArgumentException.ParamName Property
Gets the name of the parameter that causes this exception.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string ParamName { get; }
Visual Basic
Public ReadOnly Property ParamName As String
	Get
Visual C++
public:
property String^ ParamName {
	String^ get ();
}
See Also
ArgumentException Class
Autodesk.Revit.Exceptions Namespace